#Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. Числа запрашивать у
# пользователя, предусмотреть обработку ситуации деления на ноль.
def m_func(*args):
    try:
        arg1 = int(input('Введите первый аргумент: '))
        arg2 = int(input('Введите второй аргумент: '))
        res = arg1 / arg2
    except ZeroDivisionError:
        return 'Деление на 0 невозможно!'
    return res
print(f'result  {m_func()}')





