# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
# толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.

class Road:
    def __init__(self, lenght, wight):
        self._lenght = lenght
        self._wight = wight

    def get_mass(self):
        return f"{self._lenght}м*{self._wight}м*25 кг*5 см = {(self._lenght*self._wight*25*5)/1000} т"

road_1 = Road (5000, 20)
print(road_1.get_mass())