inc = int(input("Введите величину выручки Вашей компании."))
exp = int(input("Введите величину расходов Вашей компании."))
if inc>exp:
    profit=inc-exp
    rentab=profit/inc*100
    numer = int(input("Введите численность работников в Вашей компании."))
    profit_num =profit/numer
    print ('Компания работает с прибылью. Рентабельность работы компании составляет', rentab, ".")
    print("Прибыль компании на одного работника составляет", profit_num)
else:
    print("Компания работает с убытком.")
